/*******************************

モータドライバ用モータ制御関数プロトタイプ宣言

*******************************/

#ifndef MOTOR_CONTROL_H
#define MOTOR_CONTROL_H

void FirstInit(void);
void PWMConfig(char turn,char pwm);
void PWMInit(void);


/****************************************************************************************************************************************************

FirstInit()		ロボ研規格のBlueのドライバ用のGPIOとかの設定が入っている。main()のはじめに記述。
PWMConfig(*,*)	PWMConfig(aug1,aug2) と記述、aug1の下位2bitでモータの回転方向を決定　aug2は0~255(0xFF)までの値を取り、PWMのデューティが変わる
PWMInit()		ロボ研規格のBLueのドライバ用のPWM出力の設定が入っている。main()のはじめに記述。

******************************************************************************************************************************************************/

#endif